app/controllers/posts_controller.rb

    def create
        @post = Post.new(post_params)
        @post.user_id = current_user.id
        respond_to do |f|
            if (@post.save)
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "hello all my niggas"], ["user_id", 2], ["created_at", "2017-05-13 20:22:19.421696"], ["updated_at", "2017-05-13 20:22:19.421696"]]